package d0320;

class VariableExample {
	//클래스명은 대문자로 시작하는게 관례. 두번째 단어는 무조건 대문자로 시작
	public static void main(string[] args) {
		//데이터타입 변수명 = 값;
		//프로그래밍에서 =은 오른쪽에 있는 것이 왼쪽으로 들어간다는 뜻
		//기본형은 int num = 숫자;
		int a = 10; //10이라는 값이 a 라는 변수에 저장된다.
		int A = 10;
		//변수의 문자는 대소문자를 구분한다.
		int a$_ = 20;
		//변수의 천 글자는 문자 ,$, _ 이외의 숫자나 다른 기호는 불가능
		//int 10 = 10;
		//int $ = 10;
		
		String redApple = "빨간사과";
		//두 단어가 다를땐 두번째 단에 첫 글자를 대문자로 사용한다.
		//첫 글자는 소문자로 시작, 두번째 단어는 대문자로 시작하는것을 카멜표기법=낙타표기법
		//두 단어 첫글자가 대문자면 파스칼표기법 = 쌍봉낙타표기법
		//_로 두 단어 구분지어 놓으면 스네이크표기법
		//red_Apple로 표기하면 헝가리안표기법
		//변수명의 문자 제한은 없다.
	
	}
	
	

}
